{
  "id": 14,
  "module": "lld",
  "slug": "design-patterns-creational",
  "title": "Design Patterns: Creational",
  "topics": [
    "Factory",
    "Abstract Factory",
    "Singleton",
    "Builder",
    "Object creation decoupling"
  ],
  "estimatedReadMinutes": 10,
  "activities": [
    {
      "type": "spark",
      "title": "Pattern Scavenger Hunt",
      "desc": "Open any popular open-source library. Find and name at least 2 creational patterns used in the codebase. Share findings.",
      "time": "20 min",
      "format": "Group"
    },
    {
      "type": "intro",
      "title": "Builder vs Constructor Comparison",
      "desc": "Implement a Pizza class: first with a telescoping constructor, then with Builder. Count parameters and compare readability.",
      "time": "25 min",
      "format": "Solo"
    },
    {
      "type": "practice",
      "title": "Singleton Anti-pattern Lab",
      "desc": "Given a broken Singleton with thread-safety issues, students identify the race condition and fix it using double-checked locking.",
      "time": "20 min",
      "format": "Pairs"
    },
    {
      "type": "assess",
      "title": "Pattern Identification MCQ",
      "desc": "6 code snippets — identify which creational pattern each uses and what problem it solves.",
      "time": "10 min",
      "format": "Solo"
    }
  ],
  "activityTypes": [
    "spark",
    "intro",
    "practice",
    "assess"
  ],
  "sections": {
    "concepts": [
      {
        "heading": "What it is",
        "body": "Design Patterns: Creational covers the design decisions needed to build reliable systems and explain those decisions in interviews. The core focus is understanding Factory, Abstract Factory, Singleton and linking each concept to an architecture consequence."
      },
      {
        "heading": "Why it matters in interviews",
        "body": "Interviewers expect you to justify trade-offs, not just list tools. For Design Patterns: Creational, strong answers connect constraints, architecture choices, and failure behavior while staying explicit about what you would de-scope first."
      }
    ],
    "architecture": {
      "components": [
        "API Layer",
        "Controller",
        "Domain Model",
        "Service Layer",
        "Repository",
        "Database",
        "Policy Engine",
        "Observability"
      ],
      "flowSteps": [
        "Clarify scope and constraints for Design Patterns: Creational before choosing architecture primitives.",
        "Define boundaries for Factory and map request/write paths.",
        "Introduce resilience points such as retries, idempotency, and observability checkpoints.",
        "Evaluate bottlenecks under peak load or feature expansion assumptions.",
        "Capture final trade-offs and explain why rejected alternatives were not selected."
      ],
      "diagramAscii": "Client --> API Layer --> Controller --> Service Layer\n                                     |\n                                     v\n                                Domain Model\n                                     |\n                                     v\n                                Repository --> Database\n                                     |\n                                     v\n                                Observability"
    },
    "tradeoffs": [
      {
        "decision": "Inheritance vs Composition",
        "optionA": "Deep inheritance hierarchy",
        "optionB": "Composed collaborators with interfaces",
        "chooseWhen": "Use composition by default in Design Patterns: Creational; use inheritance only for stable is-a relationships.",
        "risk": "Deep hierarchies are brittle and hard to evolve."
      },
      {
        "decision": "Extensibility vs Delivery Speed",
        "optionA": "Abstracted design with extension points",
        "optionB": "Direct implementation optimized for current scope",
        "chooseWhen": "Invest in extensibility if frequent feature variants are expected; keep it direct for short-lived or fixed-scope components.",
        "risk": "Over-abstraction slows delivery; under-abstraction creates future rewrite cost."
      },
      {
        "decision": "Strict Layering vs Pragmatic Access",
        "optionA": "Controller -> Service -> Repository only",
        "optionB": "Selective shortcuts for simple reads",
        "chooseWhen": "Use strict layering for larger teams and long-lived systems; allow shortcuts for isolated utility flows.",
        "risk": "Shortcuts can spread and weaken boundaries if not governed."
      },
      {
        "decision": "Runtime Flexibility vs Predictability",
        "optionA": "Plugin/strategy driven behavior",
        "optionB": "Static branching in code paths",
        "chooseWhen": "Use strategy plugins for high variation domains; use static paths when behavior is stable.",
        "risk": "Highly dynamic systems can be harder to debug and reason about."
      }
    ],
    "examples": [
      {
        "name": "Notification Builder",
        "context": "Notification Builder demands clear boundaries around Factory and predictable behavior during peak usage.",
        "designChoice": "Use a staged design with a fast path and a durable path, then expose explicit fallback behavior to callers.",
        "why": "This keeps latency stable for normal traffic while preserving correctness for critical writes and failure recovery."
      },
      {
        "name": "Multi-tenant Config Factory",
        "context": "Multi-tenant Config Factory introduces changing requirements and forces design updates without breaking existing clients.",
        "designChoice": "Introduce stable interfaces, versioned contracts, and observability from the start so changes remain testable.",
        "why": "You can iterate safely while preserving backward compatibility and maintaining confidence in production behavior."
      }
    ],
    "interviewQa": [
      {
        "question": "How would you design design patterns: creational for 10x growth?",
        "answerFramework": [
          "Clarify constraints and traffic shape",
          "Estimate scale and hotspots",
          "Propose baseline architecture",
          "Address bottlenecks and failure modes",
          "Explain final trade-offs"
        ]
      },
      {
        "question": "Which trade-off is most important in design patterns: creational and why?",
        "answerFramework": [
          "State competing goals",
          "Choose one based on business risk",
          "Describe mitigation for the rejected option",
          "Define monitoring signals",
          "Describe revisit trigger"
        ]
      },
      {
        "question": "How do you handle failures in Factory?",
        "answerFramework": [
          "Enumerate failure classes",
          "Add retries and idempotency boundaries",
          "Plan degraded behavior",
          "Protect data correctness",
          "Close with incident response approach"
        ]
      },
      {
        "question": "What would be your API and data model choices for design patterns: creational?",
        "answerFramework": [
          "List key entities",
          "Define read/write patterns",
          "Choose consistency level",
          "Define pagination or batching strategy",
          "Cover evolution and versioning"
        ]
      },
      {
        "question": "How would you explain this design to a senior interviewer in 5 minutes?",
        "answerFramework": [
          "Start with requirements",
          "Show architecture and data flow",
          "Highlight critical trade-offs",
          "Call out failure handling",
          "Suggest future improvements"
        ]
      }
    ],
    "revision": {
      "cheatSheet": [
        "Start every Design Patterns: Creational answer with assumptions and limits.",
        "Name one latency-sensitive path and one correctness-sensitive path.",
        "State how Factory is written and read under load.",
        "Explain one scaling strategy and one fallback strategy.",
        "Mention observability: metrics, logs, and tracing checkpoints.",
        "Call out a deliberate de-scope to keep MVP practical.",
        "Finish with what you would improve in version two."
      ],
      "redFlags": [
        "Choosing technology without linking it to constraints.",
        "Ignoring data consistency or idempotency for write operations.",
        "No failure-mode story for dependency outages.",
        "No plan to measure whether the design is actually working."
      ]
    }
  }
}
